

export default function Page() {

    return (
        <div>
            <h1>서비스 이용약관</h1>
            <h2>제1조 (목적)</h2>
            <p>{'본 약관은 sim-log 운영자(이하 "서비스 제공자")가 제공하는 제반 서비스의 이용과 관련하여, 서비스 제공자와 이용자 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.'}</p>

            <h2>제2조 (정의)</h2>
            <ul>
                <li>{'1. "서비스"란 단말기의 종류와 상관없이 이용자가 이용할 수 있는 sim-log의 제반 서비스를 의미합니다.'}</li>
                <li>{'2. "이용자"란 본 약관에 따라 sim-log에서 제공하는 서비스를 이용하는 회원 및 비회원을 말합니다'}.</li>
                <li>{'3. "회원"이란 네이버 OAuth 인증을 통해 sim-log에 로그인한 자로, sim-log가 제공하는 기능을 지속적으로 이용할 수 있는 자를 말합니다.'}</li>
                <li>{'4. "비회원"이란 회원가입 없이 서비스를 이용하는 자를 말합니다.'}</li>
                <li>{'5. "콘텐츠"란 부호, 문자, 이미지, 영상, 링크 등 정보 형태로 표현된 모든 자료를 의미합니다.'}</li>
            </ul>

            <h2>제3조 (약관 외 준칙)</h2>
            <p>본 약관에서 정하지 아니한 사항은 관계 법령 또는 서비스 제공자가 정한 운영정책에 따릅니다.</p>

            <h2>제4조 (약관의 효력과 변경)</h2>
            <ul>
                <li>1. 본 약관은 서비스 초기 화면 또는 연결된 화면에 게시함으로써 효력을 발생합니다.</li>
                <li>2. 서비스 제공자는 관계 법령을 위반하지 않는 범위 내에서 본 약관을 변경할 수 있으며, 변경 시 적용일자와 개정 내용을 명시하여 사전에 공지합니다.</li>
                <li>3. 이용자가 변경된 약관에 대해 거절의 의사를 표시하지 않고 서비스를 계속 이용한 경우에는 변경에 동의한 것으로 간주합니다.</li>
            </ul>

            <h2>제5조 (이용자에 대한 통지)</h2>
            <ul>
                <li>1. 서비스 제공자는 필요 시 이용자에게 전자적 수단(이메일, 서비스 내 알림 등)으로 통지할 수 있습니다.</li>
                <li>2. 전체 이용자에게 통지할 필요가 있는 경우 서비스 내 게시판에 7일 이상 게시함으로써 개별 통지에 갈음할 수 있습니다.</li>
            </ul>

            <h2>제6조 (이용계약의 체결)</h2>
            <ul>
                <li>1. 이용자는 네이버 OAuth 인증을 통해 sim-log에 로그인함으로써 본 약관에 동의하고 서비스 이용계약을 체결한 것으로 간주합니다.</li>
            </ul>

            <h2>제7조 (회원가입의 승낙 및 제한)</h2>
            <ul>
                <li>1. 서비스 제공자는 이용자의 가입 요청에 원칙적으로 승낙합니다.</li>
                <li>2. 다음 각 호에 해당하는 경우 가입을 보류 또는 거절할 수 있습니다.</li>
                <li>3. 과거 이용제한 이력이 있는 경우</li>
                <li>4. 타인의 인증 정보를 도용한 경우</li>
                <li>5. 필수 정보 누락 또는 허위 기재한 경우</li>
                <li>6. 네이버 OAuth를 통해 만 14세 이상임이 확인되지 않은 경우</li>
                <li>7. 운영정책 위반 등 부적절하다고 판단되는 경우</li>
            </ul>

            <h2>제8조 (회원정보의 변경)</h2>
            <p>회원은 개인정보 관리 화면을 통해 본인의 정보를 수정할 수 있으며, 정보 변경 시 지체 없이 수정해야 합니다.</p>

            <h2>제9조 (회원정보의 관리 및 보호)</h2>
            <ul>
                <li>1. 아이디 및 인증 정보에 대한 관리책임은 회원에게 있으며, 제3자에게 이를 공유하거나 도용되도록 해서는 안 됩니다.</li>
                <li>2. 서비스 제공자는 공서양속에 반하거나 타인을 혼동시킬 수 있는 아이디 사용을 제한할 수 있습니다.</li>
                <li>3. 인증 정보 유출 시 회원은 즉시 서비스 제공자에게 알려야 하며, 미통보로 인한 책임은 회원에게 있습니다.</li>
            </ul>

            <h2>제10조 (서비스 제공자의 의무)</h2>
            <ul>
                <li>1. 서비스 제공자는 안정적인 서비스 제공을 위해 노력하며, 시스템 장애 발생 시 이를 신속히 복구합니다.</li>
                <li>2. 서비스 제공자는 이용자가 쉽게 알 수 있도록 연락처, 이용약관, 개인정보처리방침 등을 게시합니다.</li>
            </ul>

            <h2>제11조 (개인정보보호)</h2>
            <p>서비스 제공자는 개인정보보호법 등 관계 법령에 따라 이용자의 개인정보를 보호하며, 관련 사항은 개인정보처리방침에 따릅니다.</p>

            <h2>제12조 (이용자의 의무)</h2>
            <ul>
                <li>1. 이용자는 본 약관 및 운영정책을 준수해야 하며, 타인의 권리나 명예를 침해하는 행위를 해서는 안 됩니다.</li>
                <li>2. 인증 정보를 타인에게 제공하거나 공유해서는 안 됩니다.</li>
                <li>3. 서비스 내 명칭은 다음에 해당하는 경우 사용할 수 없습니다:</li>
                <li>4. 운영자 사칭</li>
                <li>5. 음란/선정적 표현</li>
                <li>6. 타인의 권리를 침해할 가능성이 있는 표현</li>
                <li>7. 법령에 저촉되거나 반사회적인 표현</li>
            </ul>

            <h2>제13조 (서비스의 제공)</h2>
            <p>서비스는 연중무휴 24시간 제공을 원칙으로 하나, 점검이나 장애 발생 시 일시적으로 중단될 수 있습니다.</p>

            <h2>제14조 (서비스 제한)</h2>
            <p>다음 사유 발생 시 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다:</p>
            <ul>
                <li>1. 긴급 점검, 시스템 교체 또는 장애</li>
                <li>2. 천재지변, 정전 등 불가항력적 사유</li>
            </ul>

            <h2>제15조 (탈퇴 및 해지)</h2>
            <ul>
                <li>1. 이용자는 언제든지 서비스 내 탈퇴 기능을 통해 이용계약을 해지할 수 있습니다.</li>
                <li>2. 서비스 제공자는 본 약관을 위반하거나 명백한 부정 이용이 있는 경우 사전 통지 후 이용계약을 해지할 수 있습니다.</li>
            </ul>

            <h2>제16조 (손해배상)</h2>
            <ul>
                <li>1. 일방의 귀책사유로 손해가 발생한 경우 상대방은 손해배상을 청구할 수 있습니다.</li>
                <li>2. 무료 서비스에 대해 서비스 제공자는 손해배상 책임을 지지 않습니다.</li>
            </ul>

            <h2>제17조 (면책사항)</h2>
            <ul>
                <li>1. 불가항력으로 인한 서비스 중단에 대해 서비스 제공자는 책임을 지지 않습니다.</li>
                <li>2. 이용자의 귀책으로 발생한 문제에 대해 서비스 제공자는 책임지지 않습니다.</li>
                <li>3. 이용자 간 분쟁, 콘텐츠 신뢰도 등에 대한 책임은 이용자에게 있습니다.</li>
            </ul>

            <h2>제18조 (정보 제공 및 광고)</h2>
            <ul>
                <li>1. 서비스 제공자는 서비스 운영에 필요한 정보를 공지 또는 이메일 등으로 제공할 수 있으며, 수신 거부는 설정 가능합니다.</li>
                <li>2. 광고성 정보는 관련 법령에 따라 사전 동의를 받은 경우에만 발송합니다.</li>
                <li>3. 서비스 제공자는 서비스 운영 및 유지를 위해, 콘텐츠의 본질을 해치지 않는 범위 내에서 게시글의 일부 위치에 광고를 임의로 삽입할 수 있습니다. 이 광고 삽입은 서비스 유지 비용 충당 및 개인 운영자 수익 확보의 일환으로 시행됩니다.</li>
            </ul>

            <h2>제19조 (지식재산권)</h2>
            <ul>
                <li>1. 서비스에 포함된 콘텐츠의 저작권은 서비스 제공자 또는 제휴처에 귀속됩니다.</li>
                <li>2. 이용자는 서비스 제공자의 동의 없이 이를 복제, 배포할 수 없습니다.</li>
                <li>3. 이용자가 직접 작성한 콘텐츠의 저작권은 작성자에게 귀속됩니다.</li>
            </ul>

            <h2>제20조 (콘텐츠 관리 및 삭제)</h2>
            <ul>
                <li>1. 불법 콘텐츠가 게시된 경우 관련 법령에 따라 삭제 요청이 가능하며, 서비스 제공자는 이에 따라 조치합니다.</li>
                <li>2. 명백한 침해 소지가 있는 경우 서비스 제공자가 선제적으로 임시조치할 수 있습니다.</li>
            </ul>

            <h2>제21조 (관할 및 준거법)</h2>
            <p>서비스 이용과 관련된 분쟁은 대한민국 법률을 따르며, 관할 법원은 민사소송법에 따라 정합니다.</p>

            <h2>부칙</h2>
            <p>본 약관은 2025년 6월 14일부터 시행합니다.</p>
        </div>
    )
}